---
kind: other
id: Methods.T:Autodesk.Revit.DB.PointClouds.IPointSetIterator
source: html/f7714d74-56d6-a36a-fbca-9a7d3cf14238.htm
---
# IPointSetIterator Methods

Use this method to discard any resources consumed by the iterator. Revit will call it when done using the iterator.